{
  "knowledgeBase": {
    "display_order": 60,
    "id": "kb-daily-bread-01",
    "pageTitle": "On the Petition: 'Give Us This Day Our Daily Bread'",
    "title": "On the Petition: 'Give Us This Day Our Daily Bread'",
    "summary": "An exploration of the prayer for daily bread, revealing God's promise of provision, our responsibility to the poor, the need for spiritual nourishment, and the ultimate goal of daily communion with Him.",
    "author": "Gemini Assistant",
    "lastUpdated": "2025-07-23T19:25:00-06:00",
    "entryPoints": [
      {
        "id": "bread-01-heirs",
        "step": 1,
        "title": "Heirs to the Father's House",
        "corePrinciple": "When we make God's service our first interest, we can ask with confidence for our needs, as everything in the Father's house is for us.",
        "development": "The first half of the prayer focuses on honoring God's name, kingdom, and will. When you have made His service your first interest, you may then ask with confidence that your own needs may be supplied. If you have renounced self and given yourself to Christ, you are a member of God's family, and everything in the Father's house is for you. The treasures of God, the ministry of angels, the gift of His Spirit, and the labors of His servants—all are for you. The world, with everything in it, is yours so far as it can do you good.",
        "scriptureReferences": [
          {
            "citation": "1 Corinthians 3:23, 21",
            "text": "If 'ye are Christ's,' 'all things are yours.'",
            "relevance": "Establishes the principle that believers, as members of God's family, have access to all of the Father's resources."
          }
        ],
        "keyQuote": "If you have renounced self and given yourself to Christ you are a member of the family of God, and everything in the Father's house is for you.",
        "tags": [
          "provision",
          "heirs",
          "family of God",
          "confidence",
          "trust"
        ]
      },
      {
        "id": "bread-02-daily-trust",
        "step": 2,
        "title": "Trusting for Today's Needs",
        "corePrinciple": "We are to pray for our 'daily' bread, trusting God to provide for today's needs without being dismayed about tomorrow.",
        "development": "You are as a child not yet in control of his inheritance. God does not entrust your precious possession to you at once, lest you be beguiled by Satan. Christ holds it for you, safe from the spoiler. Like a child, you shall receive day by day what is required for the day's need. You have the assurance of His promise that the righteous will not be forsaken. He who sent ravens to feed Elijah will not pass by one of His faithful children. He who gave His own Son will surely provide for our daily needs.",
        "scriptureReferences": [
          {
            "citation": "Psalm 37:25",
            "text": "I have been young, and now am old; yet have I not seen the righteous forsaken, nor his seed begging bread.",
            "relevance": "A testimony to God's lifelong faithfulness in providing for His people."
          },
          {
            "citation": "Romans 8:32",
            "text": "He that spared not His own Son, but delivered Him up for us all, how shall He not with Him also freely give us all things?",
            "relevance": "The ultimate argument for why we can trust God for smaller, daily provisions."
          }
        ],
        "keyQuote": "Like the child, you shall receive day by day what is required for the day's need. Every day you are to pray, “Give us this day our daily bread.” Be not dismayed if you have not sufficient for tomorrow.",
        "tags": [
          "daily",
          "trust",
          "provision",
          "anxiety",
          "faithfulness"
        ]
      },
      {
        "id": "bread-03-for-others",
        "step": 3,
        "title": "Bread Given in Trust for Others",
        "corePrinciple": "The use of 'us' in the prayer teaches us to pray for others' needs and to recognize that God gives to us in trust to share with the poor and hungry.",
        "development": "When we pray, 'Give US this day OUR daily bread,' we ask for others as well as ourselves. We must acknowledge that what God gives us is not for ourselves alone. God gives to us in trust, that we may feed the hungry. Of His goodness, He has prepared for the poor. He blesses us so that we may abound in every good work, teaching us that those who sow bountifully will also reap bountifully.",
        "scriptureReferences": [
          {
            "citation": "Luke 14:12-14",
            "text": "But when thou makest a feast, call the poor, the maimed, the lame, the blind: and thou shalt be blessed; for they cannot recompense thee: for thou shalt be recompensed at the resurrection of the just.",
            "relevance": "A direct command from Christ to use our provisions to care for the needy."
          }
        ],
        "keyQuote": "When we pray, “Give us this day our daily bread,” we ask for others as well as ourselves. And we acknowledge that what God gives us is not for ourselves alone.",
        "tags": [
          "sharing",
          "poor",
          "trust",
          "generosity",
          "community"
        ]
      },
      {
        "id": "bread-04-spiritual",
        "step": 4,
        "title": "The Bread of Everlasting Life",
        "corePrinciple": "The petition for 'daily bread' includes both physical food and the spiritual bread—Christ and His word—which nourishes the soul.",
        "development": "The prayer for daily bread includes not only food to sustain the body, but also that spiritual bread which will nourish the soul unto life everlasting. Jesus says, 'I am the living bread which came down from heaven.' Our Saviour is the bread of life, and it is by beholding His love and receiving it into the soul that we feed upon this bread. We receive Christ through His word, and the Holy Spirit is given to open that word to our understanding. We are to pray day by day that as we read, God will send His Spirit to reveal the truth that will strengthen our souls for the day's need.",
        "scriptureReferences": [
          {
            "citation": "John 6:51",
            "text": "I am the living bread which came down from heaven: if any man eat of this bread, he shall live forever.",
            "relevance": "Christ's own identification of Himself as the spiritual bread that gives eternal life."
          }
        ],
        "keyQuote": "Our Saviour is the bread of life, and it is by beholding His love, by receiving it into the soul, that we feed upon the bread which came down from heaven.",
        "tags": [
          "spiritual food",
          "Christ",
          "Word of God",
          "Holy Spirit",
          "nourishment"
        ]
      },
      {
        "id": "bread-05-communion",
        "step": 5,
        "title": "The Purpose: Daily Communion",
        "corePrinciple": "God asks us to pray for daily needs to make us realize our dependence on Him and to draw us into daily communion with Himself.",
        "development": "In teaching us to ask every day for what we need—both temporal and spiritual blessings—God has a purpose to accomplish for our good. He would have us realize our dependence upon His constant care, for He is seeking to draw us into communion with Himself. In this communion with Christ, through prayer and the study of the great and precious truths of His word, we shall as hungry souls be fed, and as those that thirst, we shall be refreshed at the fountain of life.",
        "scriptureReferences": [
           {
            "citation": "John 15:5",
            "text": "I am the vine, ye are the branches... for without me ye can do nothing.",
            "relevance": "Illustrates the total dependence and communion we are to have with Christ for spiritual life."
          }
        ],
        "keyQuote": "He would have us realize our dependence upon His constant care, for He is seeking to draw us into communion with Himself.",
        "tags": [
          "communion",
          "dependence",
          "relationship",
          "prayer",
          "study"
        ]
      }
    ]
  }
}