{
  "knowledgeBase": {
    "display_order": 50,
    "id": "kb-will-be-done-01",
    "pageTitle": "On the Petition: 'Thy Will Be Done'",
    "title": "On the Petition: 'Thy Will Be Done'",
    "summary": "An examination of what it means to pray for God's will to be done on earth, exploring His will as His law, the joyful obedience of heaven, and the ultimate establishment of the kingdom of righteousness.",
    "author": "Gemini Assistant",
    "lastUpdated": "2025-07-23T19:24:00-06:00",
    "entryPoints": [
      {
        "id": "will-01-standard",
        "step": 1,
        "title": "The Standard of Heaven: God's Holy Law",
        "corePrinciple": "The will of God is expressed in His holy law, and the principles of this law are the principles of heaven.",
        "development": "The will of God is not a mysterious or arbitrary concept; it is expressed in the precepts of His holy law. These principles are not just for earth, but are the very principles that govern heaven. For the angels, there is no higher knowledge than to know the will of God, and no higher service than to do His will. It is the activity that engages all of their powers.",
        "scriptureReferences": [
           {
            "citation": "Romans 7:12",
            "text": "Wherefore the law is holy, and the commandment holy, and just, and good.",
            "relevance": "Affirms the holy and good nature of the law, which the text equates with God's will."
          }
        ],
        "keyQuote": "The angels of heaven attain unto no higher knowledge than to know the will of God, and to do His will is the highest service that can engage their powers.",
        "tags": [
          "will of God",
          "law",
          "heaven",
          "principles",
          "service",
          "angels"
        ]
      },
      {
        "id": "will-02-spirit",
        "step": 2,
        "title": "The Spirit of Heaven: Service Based on Love",
        "corePrinciple": "In heaven, obedience to God's will is not a drudgery performed out of legality, but a joyful service rendered out of love.",
        "development": "Service in heaven is not rendered in a spirit of mere legality. The concept of law as a set of rules was almost an unthought-of thing to the angels before Satan's rebellion. In their ministry, they act not as servants, but as sons, with perfect unity between them and their Creator. Obedience is not a chore; their profound love for God makes their service a joy. In every soul where Christ dwells, this heavenly spirit is re-echoed.",
        "scriptureReferences": [
          {
            "citation": "Psalm 40:8",
            "text": "I delight to do Thy will, O My God: yea, Thy law is within My heart.",
            "relevance": "The model expression of joyful, heartfelt obedience that characterizes the service of heaven."
          }
        ],
        "keyQuote": "Obedience is to them no drudgery. Love for God makes their service a joy.",
        "tags": [
          "love",
          "joy",
          "service",

          "obedience",
          "sonship",
          "legality"
        ]
      },
      {
        "id": "will-03-fulfillment",
        "step": 3,
        "title": "The Prayer's Ultimate Goal for Earth",
        "corePrinciple": "To pray 'Thy will be done on earth' is to ask for the end of evil, the destruction of sin, and the full establishment of the kingdom of righteousness.",
        "development": "When we pray for God's will to be done on earth as it is in heaven, we are asking for a profound transformation of our world. It is a petition for the reign of evil on this earth to be ended. We are praying for sin to be forever destroyed and for the kingdom of righteousness to be established in its place. When this prayer is fully answered, then in earth as in heaven will be fulfilled 'all the good pleasure of His goodness.'",
        "scriptureReferences": [
           {
            "citation": "2 Thessalonians 1:11",
            "text": "...fulfil all the good pleasure of His goodness...",
            "relevance": "Describes the state of fulfillment that will be realized on earth when God's will is fully done."
          }
        ],
        "keyQuote": "The petition, “Thy will be done in earth, as it is in heaven,” is a prayer that the reign of evil on this earth may be ended, that sin may be forever destroyed, and the kingdom of righteousness be established.",
        "tags": [
          "righteousness",
          "end of sin",
          "fulfillment",
          "restoration",
          "kingdom"
        ]
      }
    ]
  }
}