{
  "forgive-us": {
    "knowledgeBase": {
      "display_order": 70,
      "id": "kb-forgive-us-01",
      "pageTitle": "On the Petition: 'Forgive Us Our Sins'",
      "title": "On the Petition: 'Forgive Us Our Sins'",
      "summary": "An in-depth look at the petition for forgiveness, exploring the conditional link between forgiving others and being forgiven by God, the transformative nature of divine pardon, and the foundation of our acceptance in Christ.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:26:00-06:00",
      "entryPoints": [
        {
          "id": "forgive-01-condition",
          "step": 1,
          "title": "The Condition of Mercy",
          "corePrinciple": "We can only receive forgiveness from God as we are willing to forgive others who have wronged us.",
          "development": "Jesus teaches that the love of God, which draws us to Him, cannot touch our hearts without creating love for our brethren. He makes this a clear condition: 'If ye forgive men their trespasses, your heavenly Father will also forgive you: but if ye forgive not men their trespasses, neither will your Father forgive your trespasses.' One who is unforgiving cuts off the very channel through which alone he can receive mercy from God.",
          "scriptureReferences": [
            {
              "citation": "Matthew 6:14-15",
              "text": "For if ye forgive men their trespasses, your heavenly Father will also forgive you: But if ye forgive not men their trespasses, neither will your Father forgive your trespasses.",
              "relevance": "Christ's direct explanation of the conditional nature of forgiveness."
            }
          ],
          "keyQuote": "He who is unforgiving cuts off the very channel through which alone he can receive mercy from God.",
          "tags": [
            "forgiveness",
            "condition",
            "mercy",
            "trespasses",
            "brethren"
          ]
        },
        {
          "id": "forgive-02-our-part",
          "step": 2,
          "title": "The Character of Our Forgiveness",
          "corePrinciple": "Our forgiveness of others should be compassionate and unconditional, not dependent on their confession or repentance.",
          "development": "We should not think that we are justified in withholding forgiveness unless those who have injured us confess the wrong. While it is their part to humble their hearts by repentance, our part is to have a spirit of compassion, whether or not they confess their faults. We are not to cherish our grievances or sympathize with ourselves over our injuries. As we hope to be pardoned for our offenses against God, we are to pardon all who have done evil to us.",
          "scriptureReferences": [
            {
              "citation": "Colossians 3:13",
              "text": "Forbearing one another, and forgiving one another, if any man have a quarrel against any: even as Christ forgave you, so also do ye.",
              "relevance": "Provides the model for our forgiveness of others—it should be like Christ's forgiveness of us."
            }
          ],
          "keyQuote": "We are to have a spirit of compassion toward those who have trespassed against us, whether or not they confess their faults.",
          "tags": [
            "compassion",
            "unconditional",
            "grievances",
            "pardon",
            "repentance"
          ]
        },
        {
          "id": "forgive-03-divine-nature",
          "step": 3,
          "title": "The Nature of Divine Forgiveness",
          "corePrinciple": "God's forgiveness is more than a legal pardon; it is a transformative, redeeming love that reclaims us from sin and creates a clean heart.",
          "development": "God's forgiveness has a broader meaning than many suppose. It is not merely a judicial act by which He sets us free from condemnation. It is not only forgiveness *for* sin, but reclaiming *from* sin. It is the outflow of redeeming love that transforms the heart. David had the true conception of forgiveness when he prayed, 'Create in me a clean heart, O God; and renew a right spirit within me.' It is a complete removal of our transgressions.",
          "scriptureReferences": [
            {
              "citation": "Isaiah 55:8-9",
              "text": "For my thoughts are not your thoughts, neither are your ways My ways, saith the Lord. For as the heavens are higher than the earth, so are My ways higher than your ways...",
              "relevance": "Shows that God's ways, including His forgiveness, are far beyond our limited human concepts."
            },
            {
              "citation": "Psalm 51:10",
              "text": "Create in me a clean heart, O God; and renew a right spirit within me.",
              "relevance": "David's prayer, which captures the true, transformative nature of God's forgiveness."
            }
          ],
          "keyQuote": "It is not only forgiveness for sin, but reclaiming from sin. It is the outflow of redeeming love that transforms the heart.",
          "tags": [
            "transformation",
            "reclaiming",
            "redeeming love",
            "clean heart",
            "judicial act"
          ]
        },
        {
          "id": "forgive-04-source",
          "step": 4,
          "title": "The Source of a Forgiving Spirit",
          "corePrinciple": "Our ability to receive and impart forgiving love comes from knowing, believing, and dwelling in the redeeming love of God revealed in Christ.",
          "development": "God in Christ gave Himself for our sins, suffering the cruel death of the cross to reveal His love and draw us to Himself. He commands us to be kind and forgiving to each other, just as He forgave us. We must let Christ, the divine Life, dwell in us. Through us, He will reveal the heaven-born love that brings hope and peace. The essential first step to both receiving and imparting this forgiving love is to know and believe the love God has for us.",
          "scriptureReferences": [
            {
              "citation": "Ephesians 4:32 (R.V.)",
              "text": "Be ye kind one to another, tenderhearted, forgiving each other, even as God also in Christ forgave you.",
              "relevance": "The direct command and model for our forgiveness of others."
            }
          ],
          "keyQuote": "The one thing essential for us in order that we may receive and impart the forgiving love of God is to know and believe the love that He has to us.",
          "tags": [
            "Christ",
            "love of God",
            "grace",
            "hope",
            "peace"
          ]
        },
        {
          "id": "forgive-05-overcoming-guilt",
          "step": 5,
          "title": "Overcoming Guilt to Receive Forgiveness",
          "corePrinciple": "We must resist Satan's attempts to make us feel our sins are too great for forgiveness and instead pray and believe in the cleansing power of Christ's blood.",
          "development": "Satan works to deceive us, leading us to think our mistakes have been so grievous that God will not hear our prayers or save us. When we try to come to God, the enemy whispers of our sins to discourage us. In these moments, we must tell the enemy that 'the blood of Jesus Christ His Son cleanseth us from all sin.' When we feel that we have sinned and cannot pray, that is the very time to pray. Ashamed and humbled we may be, but we must pray and believe in the faithful saying that Christ Jesus came into the world to save sinners.",
          "scriptureReferences": [
            {
              "citation": "1 John 1:7",
              "text": "...the blood of Jesus Christ His Son cleanseth us from all sin.",
              "relevance": "A direct promise of the power of Christ's sacrifice to overcome all sin."
            },
            {
              "citation": "1 Timothy 1:15",
              "text": "This is a faithful saying, and worthy of all acceptation, that Christ Jesus came into the world to save sinners; of whom I am chief.",
              "relevance": "A declaration of faith to be used when feeling unworthy."
            }
          ],
          "keyQuote": "When we feel that we have sinned and cannot pray, it is then the time to pray. Ashamed we may be and deeply humbled, but we must pray and believe.",
          "tags": [
            "guilt",
            "doubt",
            "Satan",
            "cleansing",
            "belief",
            "sinners"
          ]
        },
        {
          "id": "forgive-06-foundation",
          "step": 6,
          "title": "The Foundation of Forgiveness",
          "corePrinciple": "Forgiveness is not a reward for our merit but a free gift, founded entirely upon the spotless righteousness of Christ, who bore our iniquity.",
          "development": "We should not try to lessen our guilt by excusing sin; we must accept God's heavy estimate of it. Calvary alone can reveal the terrible enormity of sin. If we had to bear our own guilt, it would crush us. But the sinless One has taken our place and borne our iniquity. Therefore, forgiveness and reconciliation are not a reward for our works or merit. It is a gift to us, with its foundation for bestowal in the spotless righteousness of Christ. God is faithful and just to forgive us because of what Christ has done.",
          "scriptureReferences": [
            {
              "citation": "1 John 1:9",
              "text": "If we confess our sins, He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.",
              "relevance": "A core promise of forgiveness based not on our worthiness but on God's faithfulness and justice."
            },
            {
              "citation": "Micah 7:18",
              "text": "Who is a God like unto Thee, that pardoneth iniquity, and passeth by the transgression of the remnant of His heritage? He retaineth not His anger forever, because He delighteth in mercy.",
              "relevance": "A description of God's character as one who delights in showing mercy."
            }
          ],
          "keyQuote": "Forgiveness, reconciliation with God, comes to us, not as a reward for our works... but it is a gift unto us, having in the spotless righteousness of Christ its foundation for bestowal.",
          "tags": [
            "gift",
            "grace",
            "righteousness of Christ",
            "merit",
            "confession",
            "justice"
          ]
        }
      ]
    }
  },
  "hallowed": {
    "knowledgeBase": {
      "display_order": 30,
      "id": "kb-hallowed-name-01",
      "pageTitle": "On the Petition: 'Hallowed Be Thy Name'",
      "title": "On the Petition: 'Hallowed Be Thy Name'",
      "summary": "A detailed examination of what it means to hallow God's name, moving from outward reverence in speech to the inward representation of His character in our daily lives.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:11:00-06:00",
      "entryPoints": [
        {
          "id": "hallowed-01-reverence",
          "step": 1,
          "title": "The Foundation: Reverence in Speech and Worship",
          "corePrinciple": "Hallowing God's name begins with showing solemn reverence for His titles and approaching Him with holy awe.",
          "development": "To hallow the name of the Lord requires that the words we use to speak of the Supreme Being be uttered with reverence. We are never to treat the titles or appellations of the Deity lightly. When we enter into prayer, we are in the audience chamber of the Most High and should come before Him with holy awe. The angels themselves veil their faces in His presence. How much more should we, as finite, sinful beings, come in a reverent manner before our Maker.",
          "scriptureReferences": [
            {
              "citation": "Psalm 111:9",
              "text": "Holy and reverend is His name.",
              "relevance": "Establishes the holy nature of God's name and the reverence it deserves."
            }
          ],
          "keyQuote": "The angels veil their faces in His presence. The cherubim and the bright and holy seraphim approach His throne with solemn reverence. How much more should we... come in a reverent manner before the Lord, our Maker!",
          "tags": [
            "reverence",
            "awe",
            "worship",
            "prayer",
            "holiness"
          ]
        },
        {
          "id": "hallowed-02-character",
          "step": 2,
          "title": "The Deeper Meaning: Possessing His Character",
          "corePrinciple": "To truly hallow God's name means much more than outward reverence; it means representing His character to the world.",
          "development": "We may, like the Jews in Christ's day, show great outward reverence yet continually profane God's name. This is because 'the name of the Lord' is a representation of His character: merciful, gracious, and truthful. When we are called by His name as His children, we become His representatives. The prayer 'Hallowed be Thy name' is therefore a request that His name be hallowed *in us*. In every act of our lives, we are called upon to make His name manifest by possessing His character.",
          "scriptureReferences": [
            {
              "citation": "Exodus 34:5-7",
              "text": "(Paraphrased) The Lord is 'merciful and gracious, long-suffering, and abundant in goodness and truth, ... forgiving iniquity and transgression and sin.'",
              "relevance": "Defines the 'name' or character of God that we are called to represent."
            },
            {
              "citation": "Jeremiah 33:16",
              "text": "This is the name wherewith she shall be called, The Lord our Righteousness.",
              "relevance": "Shows that God's own name—His character of righteousness—is put upon His people."
            }
          ],
          "keyQuote": "In every act of life you are to make manifest the name of God. This petition calls upon you to possess His character.",
          "tags": [
            "character",
            "representation",
            "heritage",
            "righteousness",
            "truth"
          ]
        },
        {
          "id": "hallowed-03-method",
          "step": 3,
          "title": "The Method: How to Represent God",
          "corePrinciple": "We can only represent God's character and truly hallow His name by accepting the grace and righteousness of Christ.",
          "development": "We cannot hallow God's name or represent Him to the world through our own efforts. The only way our lives and characters can represent the very life and character of God is through the acceptance of the grace and righteousness of Christ. God sends us into the world as His representatives, and when we pray for His name to be hallowed in us, we are asking that we do no dishonor to the 'worthy name' by which we are called. This is made possible not by our own power, but by receiving the transformative grace of Christ.",
          "scriptureReferences": [
            {
              "citation": "James 2:7",
              "text": "Do not they blaspheme that worthy name by the which ye are called?",
              "relevance": "Connects our actions to the honor or dishonor of the 'worthy name' we carry as Christians."
            }
          ],
          "keyQuote": "You cannot hallow His name, you cannot represent Him to the world, unless in life and character you represent the very life and character of God. This you can do only through the acceptance of the grace and righteousness of Christ.",
          "tags": [
            "grace",
            "Christ",
            "righteousness",
            "character",
            "transformation"
          ]
        }
      ]
    }
  },
  "how-to-pray": {
    "knowledgeBase": {
      "display_order": 10,
      "id": "kb-teach-us-to-pray-01",
      "pageTitle": "On the Manner of Prayer: 'Lord, Teach Us to Pray'",
      "title": "Lord, Teach Us to Pray",
      "summary": "An exploration of the context in which the Lord's Prayer was given, revealing the disciples' deep need and Christ's ideal of prayer as a source of divine power and peace.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:17:00-06:00",
      "entryPoints": [
        {
          "id": "prayer-01-context",
          "step": 1,
          "title": "The Prayer Given Twice",
          "corePrinciple": "The Lord's Prayer was given on two separate occasions, first publicly to the multitudes and later privately to the disciples.",
          "development": "Our Saviour gave the prayer on two distinct occasions. The first was during the Sermon on the Mount, delivered to the great multitude. Some months later, after His disciples had been away from Him, they returned to find Him absorbed in communion with God. It was in response to their request on this second occasion that He repeated the prayer, emphasizing its deep and unfathomed meaning.",
          "scriptureReferences": [
            {
              "citation": "Matthew 6:9",
              "text": "After this manner therefore pray ye.",
              "relevance": "The first instance where the prayer was taught to the crowds as part of the Sermon on the Mount."
            }
          ],
          "keyQuote": "The Lord's Prayer was twice given by our Saviour, first to the multitude in the Sermon on the Mount, and again, some months later, to the disciples alone.",
          "tags": [
            "Lord's Prayer",
            "context",
            "Sermon on the Mount",
            "disciples"
          ]
        },
        {
          "id": "prayer-02-observation",
          "step": 2,
          "title": "The Source of Christ's Power",
          "corePrinciple": "The disciples connected Christ's hours of solitary prayer with the peace and power evident in His life and ministry.",
          "development": "The disciples had often observed Jesus spending long hours in solitude, communing with His Father. His days were filled with incessant labor, ministering to crowds and debating with the rabbis, leaving Him utterly wearied. Yet when He returned from these hours of prayer, they marked the look of peace on His face and the sense of refreshment that pervaded His presence. They came to understand that His divine power and heavenly wisdom were a direct result of this communion.",
          "scriptureReferences": [
            {
              "citation": "Mark 1:35",
              "text": "And in the morning, rising up a great while before day, he went out, and departed into a solitary place, and there prayed.",
              "relevance": "A biblical example of the habit of solitary prayer that the disciples observed."
            }
          ],
          "keyQuote": "It was from hours spent with God that He came forth, morning by morning, to bring the light of heaven to men. The disciples had come to connect His hours of prayer with the power of His words and works.",
          "tags": [
            "prayer",
            "power",
            "peace",
            "communion",
            "solitude"
          ]
        },
        {
          "id": "prayer-03-request",
          "step": 3,
          "title": "The Humble Request",
          "corePrinciple": "Awed by Christ's communion with God, the disciples were humbled with a conviction of their own deep spiritual need.",
          "development": "On returning to their Lord, the disciples found Him praying aloud, His face irradiated with a celestial brightness as if in the very presence of the Unseen. As they listened, their hearts were deeply moved, awed, and humbled. When He finished, it was not with academic curiosity, but with a profound conviction of their own spiritual need that they made their request. They saw the source of their Master's strength and realized they lacked it.",
          "scriptureReferences": [
            {
              "citation": "Luke 11:1",
              "text": "Lord, teach us to pray.",
              "relevance": "The direct, heartfelt plea from the disciples, born out of a sense of deep need."
            }
          ],
          "keyQuote": "Now, as they listened to His supplication, their hearts were awed and humbled. As He ceased praying, it was with a conviction of their own deep need that they exclaimed, 'Lord, teach us to pray.'",
          "tags": [
            "humility",
            "need",
            "awe",
            "disciples",
            "supplication"
          ]
        },
        {
          "id": "prayer-04-ideal",
          "step": 4,
          "title": "A Principle, Not a Formula",
          "corePrinciple": "The Lord's Prayer is not a rigid formula to be repeated, but Christ's own ideal of prayer—simple, comprehensive, and based on relationship.",
          "development": "In response, Jesus gave them no new form of prayer, but repeated what He had taught before, emphasizing that its meaning was deeper than they had yet understood. He did not restrict us to the use of these exact words. As one with humanity, He presented His own ideal of prayer. The words are simple enough for a child, yet so comprehensive that their significance can never be fully grasped by the greatest minds. It teaches us the essential elements of true prayer: thanksgiving, petition, confession, and claiming God's mercy according to His promise.",
          "scriptureReferences": [
            {
              "citation": "Matthew 6:7",
              "text": "But when ye pray, use not vain repetitions, as the heathen do: for they think that they shall be heard for their much speaking.",
              "relevance": "Reinforces that prayer is about sincere communication, not the recitation of a formula."
            }
          ],
          "keyQuote": "As one with humanity, He presents His own ideal of prayer, words so simple that they may be adopted by the little child, yet so comprehensive that their significance can never be fully grasped by the greatest minds.",
          "tags": [
            "ideal",
            "principle",
            "thanksgiving",
            "confession",
            "mercy"
          ]
        }
      ]
    }
  },
  "lead-us-not": {
    "knowledgeBase": {
      "display_order": 80,
      "id": "kb-temptation-01",
      "pageTitle": "On the Petition: 'Lead Us Not into Temptation'",
      "title": "On the Petition: 'Lead Us Not into Temptation'",
      "summary": "A structured exploration of the source of temptation, the purpose of trials, and the divine safeguards available to the believer, based on the provided commentary.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-12T17:20:00-06:00",
      "entryPoints": [
        {
          "id": "temptation-01-source",
          "step": 1,
          "title": "The Source and Nature of Temptation",
          "corePrinciple": "Temptation to sin does not come from God, but from Satan and the evil within our own hearts.",
          "development": "It is a foundational truth that God does not tempt anyone with evil. The desire to sin originates from two distinct sources: the external influence of Satan, who acts as the accuser, and the internal inclinations of our own flawed nature. Satan's strategy is to entice us into sin, thereby exposing our character weaknesses, so he can then accuse us before the heavenly universe as being unworthy of God's love and redemption.",
          "scriptureReferences": [
            {
              "citation": "James 1:13 (R.V.)",
              "text": "God cannot be tempted with evil, and He Himself tempteth no man.",
              "relevance": "Establishes the core principle that God is not the source of temptation."
            },
            {
              "citation": "Zechariah 3:1-4",
              "text": "(Paraphrased) Satan is seen standing at the right hand of the Angel of the Lord, accusing Joshua the high priest... resisting the work the Angel desires to do for him.",
              "relevance": "Provides a symbolic prophecy of Satan's role as the accuser who tempts and then points out the sin."
            }
          ],
          "keyQuote": "The enemy leads us into sin, and then he accuses us before the heavenly universe as unworthy of the love of God.",
          "tags": [
            "temptation",
            "sin",
            "satan",
            "source",
            "evil",
            "accusation"
          ]
        },
        {
          "id": "temptation-02-purpose",
          "step": 2,
          "title": "The Purpose of Trials vs. Temptation",
          "corePrinciple": "God permits trials as a blessing to build character, while the prayer asks for protection from being overcome by our own evil desires.",
          "development": "There is a critical distinction between trials and temptations. God allows us to encounter hardships, persecution, and obstacles not as a punishment, but as the greatest blessing for our spiritual development. Each trial we endure and every temptation we resist through divine power becomes a new experience that advances us in character building. Therefore, the prayer 'Lead us not into temptation' is not a request to live a life free of all difficulty. Rather, it is a humble surrender to God's guidance, asking Him to lead us in safe paths and not allow us to be brought into situations where we would be drawn away and defeated by our own sinful inclinations.",
          "scriptureReferences": [
            {
              "citation": "Isaiah 30:21",
              "text": "This is the way, walk ye in it.",
              "relevance": "Illustrates the desired state of listening to God's voice for guidance in safe paths."
            }
          ],
          "keyQuote": "Every temptation resisted, every trial bravely borne, gives us a new experience and advances us in the work of character building.",
          "tags": [
            "trials",
            "character",
            "blessing",
            "hardship",
            "guidance",
            "surrender"
          ]
        },
        {
          "id": "temptation-03-safeguard",
          "step": 3,
          "title": "The Christian's Safeguard and Response",
          "corePrinciple": "The ultimate safeguard is the indwelling of Christ, and our responsibility is to avoid the ground where temptation thrives.",
          "development": "The prayer itself contains a promise of protection. When we commit ourselves to God, we have the assurance that He will provide a 'way to escape' any temptation we face. However, the only truly effective safeguard against the power of evil is the constant presence of Christ in the heart through faith in His righteousness. It is this indwelling that exposes selfishness—the root of temptation's power—and transforms the character. Our part in this is proactive: we must not entertain or linger on the supposed benefits of sin. We are called to consciously close every avenue through which the tempter might gain access to our hearts and minds.",
          "scriptureReferences": [
            {
              "citation": "1 Corinthians 10:13",
              "text": "He 'will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it.'",
              "relevance": "The explicit promise that God provides a means of escape from overwhelming temptation."
            }
          ],
          "keyQuote": "The only safeguard against evil is the indwelling of Christ in the heart through faith in His righteousness.",
          "tags": [
            "safeguard",
            "protection",
            "Christ",
            "faith",
            "escape",
            "responsibility"
          ]
        },
        {
          "id": "temptation-04-conflict",
          "step": 4,
          "title": "The Reality of Spiritual Conflict",
          "corePrinciple": "We are not alone in the battle against evil; Christ intercedes for us and heavenly angels are sent to aid us.",
          "development": "We are participants in a real, though unseen, spiritual conflict. We are not left to fight alone. Christ, who died for us, will never abandon us in the battle. He actively intercedes on our behalf, praying for our faith as He did for Peter. Furthermore, angelic beings are dispatched to aid those who are tempted, pushing back the forces of evil and guiding them to stand on a sure foundation. The ultimate security lies in knowing and believing the love God has for us. This love acts as an impregnable fortress against all of Satan's deceptions and assaults.",
          "scriptureReferences": [
            {
              "citation": "Luke 22:31, 32",
              "text": "Satan hath desired to have you, that he may sift you as wheat: but I have prayed for thee, that thy faith fail not.",
              "relevance": "Shows Christ's active intercession for his followers in the face of spiritual attack."
            },
            {
              "citation": "Proverbs 18:10",
              "text": "The name of the Lord is a strong tower: the righteous runneth into it, and is safe.",
              "relevance": "A metaphor for the security and safety found in God's character and power."
            }
          ],
          "keyQuote": "The battles waging between the two armies are as real as those fought by the armies of this world, and on the issue of the spiritual conflict eternal destinies depend.",
          "tags": [
            "spiritual warfare",
            "conflict",
            "angels",
            "intercession",
            "security",
            "love of God"
          ]
        }
      ]
    }
  },
  "our-daily-bread": {
    "knowledgeBase": {
      "display_order": 60,
      "id": "kb-daily-bread-01",
      "pageTitle": "On the Petition: 'Give Us This Day Our Daily Bread'",
      "title": "On the Petition: 'Give Us This Day Our Daily Bread'",
      "summary": "An exploration of the prayer for daily bread, revealing God's promise of provision, our responsibility to the poor, the need for spiritual nourishment, and the ultimate goal of daily communion with Him.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:25:00-06:00",
      "entryPoints": [
        {
          "id": "bread-01-heirs",
          "step": 1,
          "title": "Heirs to the Father's House",
          "corePrinciple": "When we make God's service our first interest, we can ask with confidence for our needs, as everything in the Father's house is for us.",
          "development": "The first half of the prayer focuses on honoring God's name, kingdom, and will. When you have made His service your first interest, you may then ask with confidence that your own needs may be supplied. If you have renounced self and given yourself to Christ, you are a member of God's family, and everything in the Father's house is for you. The treasures of God, the ministry of angels, the gift of His Spirit, and the labors of His servants—all are for you. The world, with everything in it, is yours so far as it can do you good.",
          "scriptureReferences": [
            {
              "citation": "1 Corinthians 3:23, 21",
              "text": "If 'ye are Christ's,' 'all things are yours.'",
              "relevance": "Establishes the principle that believers, as members of God's family, have access to all of the Father's resources."
            }
          ],
          "keyQuote": "If you have renounced self and given yourself to Christ you are a member of the family of God, and everything in the Father's house is for you.",
          "tags": [
            "provision",
            "heirs",
            "family of God",
            "confidence",
            "trust"
          ]
        },
        {
          "id": "bread-02-daily-trust",
          "step": 2,
          "title": "Trusting for Today's Needs",
          "corePrinciple": "We are to pray for our 'daily' bread, trusting God to provide for today's needs without being dismayed about tomorrow.",
          "development": "You are as a child not yet in control of his inheritance. God does not entrust your precious possession to you at once, lest you be beguiled by Satan. Christ holds it for you, safe from the spoiler. Like a child, you shall receive day by day what is required for the day's need. You have the assurance of His promise that the righteous will not be forsaken. He who sent ravens to feed Elijah will not pass by one of His faithful children. He who gave His own Son will surely provide for our daily needs.",
          "scriptureReferences": [
            {
              "citation": "Psalm 37:25",
              "text": "I have been young, and now am old; yet have I not seen the righteous forsaken, nor his seed begging bread.",
              "relevance": "A testimony to God's lifelong faithfulness in providing for His people."
            },
            {
              "citation": "Romans 8:32",
              "text": "He that spared not His own Son, but delivered Him up for us all, how shall He not with Him also freely give us all things?",
              "relevance": "The ultimate argument for why we can trust God for smaller, daily provisions."
            }
          ],
          "keyQuote": "Like the child, you shall receive day by day what is required for the day's need. Every day you are to pray, “Give us this day our daily bread.” Be not dismayed if you have not sufficient for tomorrow.",
          "tags": [
            "daily",
            "trust",
            "provision",
            "anxiety",
            "faithfulness"
          ]
        },
        {
          "id": "bread-03-for-others",
          "step": 3,
          "title": "Bread Given in Trust for Others",
          "corePrinciple": "The use of 'us' in the prayer teaches us to pray for others' needs and to recognize that God gives to us in trust to share with the poor and hungry.",
          "development": "When we pray, 'Give US this day OUR daily bread,' we ask for others as well as ourselves. We must acknowledge that what God gives us is not for ourselves alone. God gives to us in trust, that we may feed the hungry. Of His goodness, He has prepared for the poor. He blesses us so that we may abound in every good work, teaching us that those who sow bountifully will also reap bountifully.",
          "scriptureReferences": [
            {
              "citation": "Luke 14:12-14",
              "text": "But when thou makest a feast, call the poor, the maimed, the lame, the blind: and thou shalt be blessed; for they cannot recompense thee: for thou shalt be recompensed at the resurrection of the just.",
              "relevance": "A direct command from Christ to use our provisions to care for the needy."
            }
          ],
          "keyQuote": "When we pray, “Give us this day our daily bread,” we ask for others as well as ourselves. And we acknowledge that what God gives us is not for ourselves alone.",
          "tags": [
            "sharing",
            "poor",
            "trust",
            "generosity",
            "community"
          ]
        },
        {
          "id": "bread-04-spiritual",
          "step": 4,
          "title": "The Bread of Everlasting Life",
          "corePrinciple": "The petition for 'daily bread' includes both physical food and the spiritual bread—Christ and His word—which nourishes the soul.",
          "development": "The prayer for daily bread includes not only food to sustain the body, but also that spiritual bread which will nourish the soul unto life everlasting. Jesus says, 'I am the living bread which came down from heaven.' Our Saviour is the bread of life, and it is by beholding His love and receiving it into the soul that we feed upon this bread. We receive Christ through His word, and the Holy Spirit is given to open that word to our understanding. We are to pray day by day that as we read, God will send His Spirit to reveal the truth that will strengthen our souls for the day's need.",
          "scriptureReferences": [
            {
              "citation": "John 6:51",
              "text": "I am the living bread which came down from heaven: if any man eat of this bread, he shall live forever.",
              "relevance": "Christ's own identification of Himself as the spiritual bread that gives eternal life."
            }
          ],
          "keyQuote": "Our Saviour is the bread of life, and it is by beholding His love, by receiving it into the soul, that we feed upon the bread which came down from heaven.",
          "tags": [
            "spiritual food",
            "Christ",
            "Word of God",
            "Holy Spirit",
            "nourishment"
          ]
        },
        {
          "id": "bread-05-communion",
          "step": 5,
          "title": "The Purpose: Daily Communion",
          "corePrinciple": "God asks us to pray for daily needs to make us realize our dependence on Him and to draw us into daily communion with Himself.",
          "development": "In teaching us to ask every day for what we need—both temporal and spiritual blessings—God has a purpose to accomplish for our good. He would have us realize our dependence upon His constant care, for He is seeking to draw us into communion with Himself. In this communion with Christ, through prayer and the study of the great and precious truths of His word, we shall as hungry souls be fed, and as those that thirst, we shall be refreshed at the fountain of life.",
          "scriptureReferences": [
            {
              "citation": "John 15:5",
              "text": "I am the vine, ye are the branches... for without me ye can do nothing.",
              "relevance": "Illustrates the total dependence and communion we are to have with Christ for spiritual life."
            }
          ],
          "keyQuote": "He would have us realize our dependence upon His constant care, for He is seeking to draw us into communion with Himself.",
          "tags": [
            "communion",
            "dependence",
            "relationship",
            "prayer",
            "study"
          ]
        }
      ]
    }
  },
  "our-father": {
    "knowledgeBase": {
      "display_order": 20,
      "id": "kb-our-father-01",
      "pageTitle": "On the Petition: 'Our Father'",
      "title": "On the Petition: 'Our Father'",
      "summary": "An exploration of the profound truth that we are welcomed into God's family, what this divine relationship means for our identity and security, and the responsibilities it places upon us.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:21:00-06:00",
      "entryPoints": [
        {
          "id": "father-01-assurance",
          "step": 1,
          "title": "The Assurance of Our Divine Relationship",
          "corePrinciple": "The first words of the prayer, 'Our Father,' are a divinely given assurance that we are welcomed as members of God's family.",
          "development": "Jesus teaches us to call His Father our Father. He is not ashamed to call us brethren. So ready and eager is the Saviour's heart to welcome us that in the very first words we use in approaching God, He places the assurance of our divine relationship. This is an announcement of the wonderful truth, full of encouragement and comfort, that God loves us as He loves His Son.",
          "scriptureReferences": [
            {
              "citation": "Hebrews 2:11",
              "text": "He is not ashamed to call them brethren.",
              "relevance": "Shows Christ's eagerness to welcome us into the family of God."
            },
            {
              "citation": "John 17:23",
              "text": "Thou 'hast loved them, as Thou hast loved Me.'",
              "relevance": "Christ's own testimony to the Father's love for believers."
            }
          ],
          "keyQuote": "So ready, so eager, is the Saviour's heart to welcome us as members of the family of God, that in the very first words we are to use in approaching God He places the assurance of our divine relationship, “Our Father.”",
          "tags": [
            "assurance",
            "relationship",
            "family of God",
            "love",
            "welcome"
          ]
        },
        {
          "id": "father-02-identity",
          "step": 2,
          "title": "Our New Identity: Heirs, Not Orphans",
          "corePrinciple": "By accepting Christ as our personal Saviour, we are adopted as children of God and are no longer orphans left to bear the burden of our sins.",
          "development": "It was in behalf of those who had transgressed the law that Jesus took upon Him human nature; He became like us that we might have everlasting peace and assurance. How can we ever be in doubt and feel that we are orphans? We have an Advocate in the heavens, and whoever accepts Him is not left to bear the burden of his own sins. The very first step in approaching God is to know and believe the love that He has for us, for it is this love that leads us to Him.",
          "scriptureReferences": [
            {
              "citation": "1 John 3:2",
              "text": "Beloved, now are we the sons of God... we know that, when He shall appear, we shall be like Him; for we shall see Him as He is.",
              "relevance": "Confirms our present status as God's children and our future hope."
            },
            {
              "citation": "Romans 8:17",
              "text": "And if children, then heirs; heirs of God, and joint heirs with Christ...",
              "relevance": "Explains the inheritance and privilege that comes with being a child of God."
            }
          ],
          "keyQuote": "We have an Advocate in the heavens, and whoever accepts Him as a personal Saviour is not left an orphan to bear the burden of his own sins.",
          "tags": [
            "identity",
            "adoption",
            "heirs",
            "assurance",
            "advocate"
          ]
        },
        {
          "id": "father-03-responsibility",
          "step": 3,
          "title": "The Responsibility to Our Brethren",
          "corePrinciple": "In calling God 'Our Father,' we recognize all of His children as our brethren and must include them in our prayers and concerns.",
          "development": "The perception of God's love works the renunciation of selfishness. When we call God our Father, we recognize all His children as our brethren. We are all a part of the great web of humanity, all members of one family. In our petitions we are to include our neighbors as well as ourselves. No one prays aright who seeks a blessing for himself alone. The infinite God listens to every prayer and tastes the sorrows of every soul; He regards the treatment given to every member of the human family.",
          "scriptureReferences": [
            {
              "citation": "1 John 4:16",
              "text": "And we have known and believed the love that God hath to us. God is love; and he that dwelleth in love dwelleth in God, and God in him.",
              "relevance": "Highlights that knowing and believing God's love is the foundation for loving others."
            }
          ],
          "keyQuote": "In our petitions we are to include our neighbors as well as ourselves. No one prays aright who seeks a blessing for himself alone.",
          "tags": [
            "responsibility",
            "brethren",
            "family",
            "neighbors",
            "selfishness"
          ]
        },
        {
          "id": "father-04-sonship",
          "step": 4,
          "title": "The Joyful Duty of Sonship",
          "corePrinciple": "If we call God our Father, we joyfully acknowledge ourselves as His children, accepting His plan and making His honor our highest interest.",
          "development": "When you call God your Father, you acknowledge yourselves as His children, to be guided by His wisdom and to be obedient in all things, knowing that His love is changeless. You will accept His plan for your life. As children of God, you will hold His honor, His character, His family, and His work as the objects of your highest interest. It will be your joy to recognize your relation to your Father and to every member of His family, and you will rejoice to do any act, however humble, that will tend to His glory or to the well-being of your kindred.",
          "scriptureReferences": [
            {
              "citation": "Psalm 56:3",
              "text": "What time I am afraid, I will trust in Thee.",
              "relevance": "An expression of the trust a child places in their heavenly Father's care."
            }
          ],
          "keyQuote": "As children of God, you will hold His honor, His character, His family, His work, as the objects of your highest interest.",
          "tags": [
            "sonship",
            "obedience",
            "joy",
            "honor",
            "glory"
          ]
        }
      ]
    }
  },
  "thine-is-the-kingdom": {
    "knowledgeBase": {
      "display_order": 90,
      "id": "kb-doxology-01",
      "pageTitle": "On the Doxology: 'Thine is the Kingdom'",
      "title": "On the Doxology: 'Thine is the Kingdom'",
      "summary": "An exploration of the prayer's concluding doxology, which points believers to God's ultimate sovereignty and care, offering assurance that His kingdom, power, and glory rule over all, even in times of global crisis and strife.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:29:00-06:00",
      "entryPoints": [
        {
          "id": "doxology-01-anchor",
          "step": 1,
          "title": "An Anchor in Coming Storms",
          "corePrinciple": "The doxology directs believers to look above the power of evil to God, whose kingdom rules over all, even in the face of future trials.",
          "development": "The last sentence of the Lord's Prayer, like the first, points to our Father as being above all power and authority. The Saviour saw the years ahead for His disciples not as times of peace, but as dark with tempests of hatred and wrath. Amid national strife and ruin, their steps would be beset with perils. Yet, Christ's followers were not to fear that their hope was lost or that God had forsaken the earth. The power and the glory belong to Him, whose great purposes move on unthwarted.",
          "scriptureReferences": [
            {
              "citation": "Matthew 24:6-8",
              "text": "Ye shall hear of wars and rumors of wars... Nation shall rise against nation, and kingdom against kingdom: and there shall be famines, and pestilences, and earthquakes, in divers places. All these are the beginning of sorrows.",
              "relevance": "Describes the future trials that Christ's followers were told not to fear, as God's purposes would move on unthwarted."
            }
          ],
          "keyQuote": "In the prayer that breathes their daily wants, the disciples of Christ were directed to look above all the power and dominion of evil, unto the Lord their God, whose kingdom ruleth over all and who is their Father and everlasting Friend.",
          "tags": [
            "sovereignty",
            "assurance",
            "hope",
            "trials",
            "fearlessness"
          ]
        },
        {
          "id": "doxology-02-ruler",
          "step": 2,
          "title": "The Sovereign Ruler of Nations",
          "corePrinciple": "God is in complete control of world events; the destiny of nations and the concerns of His church are in His hands.",
          "development": "The ruin of Jerusalem was a symbol of the final ruin that will overwhelm the world, and the prophecies of that time apply directly to the last days. We are now on the threshold of great and solemn events, a crisis such as the world has never witnessed. Yet, the assurance remains that God's kingdom rules over all. The program of coming events is in the hands of our Maker. The Majesty of heaven has the destiny of nations, as well as the concerns of His church, in His own charge.",
          "scriptureReferences": [
            {
              "citation": "Isaiah 45:5",
              "text": "I girded thee, though thou hast not known Me.",
              "relevance": "An example of God's sovereign control over world leaders and events, even when they are unaware of His hand."
            }
          ],
          "keyQuote": "The program of coming events is in the hands of our Maker. The Majesty of heaven has the destiny of nations, as well as the concerns of His church, in His own charge.",
          "tags": [
            "destiny",
            "nations",
            "control",
            "prophecy",
            "crisis"
          ]
        },
        {
          "id": "doxology-03-divine-power",
          "step": 3,
          "title": "The Unseen Hand of Divine Power",
          "corePrinciple": "God's divine power is constantly at work to accomplish His designs, thwart the plans of evil, and give success to His servants.",
          "development": "The prophet Ezekiel's vision of a hand beneath the wings of the cherubim teaches us that it is divine power that gives God's servants success. We are not left to carry the burden of responsibility alone. He who never slumbers is continually at work to accomplish His designs. He will thwart the purposes of wicked men and bring to confusion the counsels of those who plot mischief against His people. The King, the Lord of hosts, sits between the cherubim and guards His children still.",
          "scriptureReferences": [
            {
              "citation": "Ezekiel 1:8",
              "text": "And they had the hands of a man under their wings on their four sides...",
              "relevance": "The source of the imagery used to teach that God's power is actively at work, guiding events."
            }
          ],
          "keyQuote": "He who slumbers not, who is continually at work for the accomplishment of His designs, will carry forward His own work. He will thwart the purposes of wicked men, and will bring to confusion the counsels of those who plot mischief against His people.",
          "tags": [
            "divine power",
            "providence",
            "protection",
            "success",
            "responsibility"
          ]
        },
        {
          "id": "doxology-04-safety",
          "step": 4,
          "title": "An Unshakable Security",
          "corePrinciple": "Amid the strife and tumult of nations, God guards His children, and they will be safe in His hands.",
          "development": "He who rules in the heavens is our Saviour. He measures every trial and watches the furnace fire that must test every soul. When the strongholds of kings are overthrown, when the arrows of wrath strike through the hearts of His enemies, His people will be safe in His hands. In His hand is power and might, and it is in His hand to make great and to give strength to all.",
          "scriptureReferences": [
            {
              "citation": "1 Chronicles 29:11, 12",
              "text": "Thine, O Lord, is the greatness, and the power, and the glory, and the victory, and the majesty: for all that is in the heaven and in the earth is Thine.... In Thine hand is power and might; and in Thine hand it is to make great, and to give strength unto all.",
              "relevance": "A powerful doxology that affirms God's ultimate power, glory, and ability to strengthen His people."
            }
          ],
          "keyQuote": "When the strongholds of kings shall be overthrown, when the arrows of wrath shall strike through the hearts of His enemies, His people will be safe in His hands.",
          "tags": [
            "safety",
            "security",
            "refuge",
            "strength",
            "tumult"
          ]
        }
      ]
    }
  },
  "thy-kingdom-come": {
    "knowledgeBase": {
      "display_order": 40,
      "id": "kb-kingdom-come-01",
      "pageTitle": "On the Petition: 'Thy Kingdom Come'",
      "title": "On the Petition: 'Thy Kingdom Come'",
      "summary": "An analysis of the prayer for God's kingdom, distinguishing between the present kingdom of grace being established in human hearts and the future kingdom of glory to be fully realized at Christ's second coming.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:22:00-06:00",
      "entryPoints": [
        {
          "id": "kingdom-01-assurance",
          "step": 1,
          "title": "A Future Hope and Present Assurance",
          "corePrinciple": "The prayer for the kingdom is an assurance that, while it is a future event, its coming is certain in God's own time.",
          "development": "God is our Father, but He is also the great King of the universe. The interests of His kingdom are our interests. When Jesus taught this prayer, the disciples were looking for an immediate, glorious kingdom. Jesus corrected this by teaching them to pray for it as an event yet future. This was not a disappointment, but an assurance. While they would not see the kingdom in their day, the fact that Jesus instructed them to pray for it is evidence that it will surely come at the time God has appointed.",
          "scriptureReferences": [
            {
              "citation": "Matthew 6:10",
              "text": "Thy kingdom come.",
              "relevance": "The direct petition taught by Christ, affirming the kingdom as a central hope for believers."
            }
          ],
          "keyQuote": "While they were not to behold the coming of the kingdom in their day, the fact that Jesus bade them pray for it is evidence that in God's own time it will surely come.",
          "tags": [
            "kingdom",
            "future hope",
            "assurance",
            "certainty",
            "God's timing"
          ]
        },
        {
          "id": "kingdom-02-two-kingdoms",
          "step": 2,
          "title": "The Kingdom of Grace and of Glory",
          "corePrinciple": "There are two phases of God's kingdom: the kingdom of grace, which is being established now in human hearts, and the kingdom of glory, which will be established at Christ's return.",
          "development": "The kingdom of God's grace is being established now, day by day, as hearts that were once full of sin and rebellion yield to the sovereignty of His love. This is the inward, spiritual kingdom. However, the full establishment of the kingdom of His glory will not take place until the second coming of Christ to this world. At that time, the saints will inherit the kingdom prepared for them from the foundation of the world, and Christ will take His great power and reign as King of kings.",
          "scriptureReferences": [
            {
              "citation": "Daniel 7:27",
              "text": "The kingdom and dominion, and the greatness of the kingdom under the whole heaven, shall be given to the people of the saints of the Most High.",
              "relevance": "Prophetically describes the establishment of the kingdom of glory."
            },
            {
              "citation": "Zechariah 14:9",
              "text": "And the Lord shall be king over all the earth: in that day shall there be one Lord, and His name one.",
              "relevance": "A prophecy of the final, visible reign of God in the kingdom of glory."
            }
          ],
          "keyQuote": "The kingdom of God's grace is now being established, as day by day hearts that have been full of sin and rebellion yield to the sovereignty of His love. But the full establishment of the kingdom of His glory will not take place until the second coming of Christ.",
          "tags": [
            "kingdom of grace",
            "kingdom of glory",
            "second coming",
            "inheritance",
            "reign of Christ"
          ]
        },
        {
          "id": "kingdom-03-our-role",
          "step": 3,
          "title": "Our Role in Hastening the Kingdom",
          "corePrinciple": "We hasten the coming of the kingdom by giving ourselves to God and winning other souls to Him through the preaching of the gospel.",
          "development": "Before His glorious return, Jesus said, 'This gospel of the kingdom shall be preached in all the world for a witness unto all nations.' Therefore, His kingdom will not come until the good tidings of His grace have been carried to all the earth. As we give ourselves to God and win other souls to Him, we are actively hastening the coming of His kingdom. The prayer 'Thy kingdom come' is prayed with sincerity only by those who devote themselves to His service.",
          "scriptureReferences": [
            {
              "citation": "Matthew 24:14",
              "text": "This gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come.",
              "relevance": "Establishes the preaching of the gospel as the final prerequisite for the kingdom's coming."
            },
            {
              "citation": "Isaiah 6:8",
              "text": "Here am I; send me.",
              "relevance": "The response of one who is devoted to God's service and is willing to spread the gospel."
            }
          ],
          "keyQuote": "Hence, as we give ourselves to God, and win other souls to Him, we hasten the coming of His kingdom.",
          "tags": [
            "gospel",
            "evangelism",
            "service",
            "hastening",
            "witness"
          ]
        }
      ]
    }
  },
  "thy-wil-be-done": {
    "knowledgeBase": {
      "display_order": 50,
      "id": "kb-will-be-done-01",
      "pageTitle": "On the Petition: 'Thy Will Be Done'",
      "title": "On the Petition: 'Thy Will Be Done'",
      "summary": "An examination of what it means to pray for God's will to be done on earth, exploring His will as His law, the joyful obedience of heaven, and the ultimate establishment of the kingdom of righteousness.",
      "author": "Gemini Assistant",
      "lastUpdated": "2025-07-23T19:24:00-06:00",
      "entryPoints": [
        {
          "id": "will-01-standard",
          "step": 1,
          "title": "The Standard of Heaven: God's Holy Law",
          "corePrinciple": "The will of God is expressed in His holy law, and the principles of this law are the principles of heaven.",
          "development": "The will of God is not a mysterious or arbitrary concept; it is expressed in the precepts of His holy law. These principles are not just for earth, but are the very principles that govern heaven. For the angels, there is no higher knowledge than to know the will of God, and no higher service than to do His will. It is the activity that engages all of their powers.",
          "scriptureReferences": [
            {
              "citation": "Romans 7:12",
              "text": "Wherefore the law is holy, and the commandment holy, and just, and good.",
              "relevance": "Affirms the holy and good nature of the law, which the text equates with God's will."
            }
          ],
          "keyQuote": "The angels of heaven attain unto no higher knowledge than to know the will of God, and to do His will is the highest service that can engage their powers.",
          "tags": [
            "will of God",
            "law",
            "heaven",
            "principles",
            "service",
            "angels"
          ]
        },
        {
          "id": "will-02-spirit",
          "step": 2,
          "title": "The Spirit of Heaven: Service Based on Love",
          "corePrinciple": "In heaven, obedience to God's will is not a drudgery performed out of legality, but a joyful service rendered out of love.",
          "development": "Service in heaven is not rendered in a spirit of mere legality. The concept of law as a set of rules was almost an unthought-of thing to the angels before Satan's rebellion. In their ministry, they act not as servants, but as sons, with perfect unity between them and their Creator. Obedience is not a chore; their profound love for God makes their service a joy. In every soul where Christ dwells, this heavenly spirit is re-echoed.",
          "scriptureReferences": [
            {
              "citation": "Psalm 40:8",
              "text": "I delight to do Thy will, O My God: yea, Thy law is within My heart.",
              "relevance": "The model expression of joyful, heartfelt obedience that characterizes the service of heaven."
            }
          ],
          "keyQuote": "Obedience is to them no drudgery. Love for God makes their service a joy.",
          "tags": [
            "love",
            "joy",
            "service",
            "obedience",
            "sonship",
            "legality"
          ]
        },
        {
          "id": "will-03-fulfillment",
          "step": 3,
          "title": "The Prayer's Ultimate Goal for Earth",
          "corePrinciple": "To pray 'Thy will be done on earth' is to ask for the end of evil, the destruction of sin, and the full establishment of the kingdom of righteousness.",
          "development": "When we pray for God's will to be done on earth as it is in heaven, we are asking for a profound transformation of our world. It is a petition for the reign of evil on this earth to be ended. We are praying for sin to be forever destroyed and for the kingdom of righteousness to be established in its place. When this prayer is fully answered, then in earth as in heaven will be fulfilled 'all the good pleasure of His goodness.'",
          "scriptureReferences": [
            {
              "citation": "2 Thessalonians 1:11",
              "text": "...fulfil all the good pleasure of His goodness...",
              "relevance": "Describes the state of fulfillment that will be realized on earth when God's will is fully done."
            }
          ],
          "keyQuote": "The petition, “Thy will be done in earth, as it is in heaven,” is a prayer that the reign of evil on this earth may be ended, that sin may be forever destroyed, and the kingdom of righteousness be established.",
          "tags": [
            "righteousness",
            "end of sin",
            "fulfillment",
            "restoration",
            "kingdom"
          ]
        }
      ]
    }
  }
}